[
    "A smile is the shortest distance between two people.",
    "Smiling is the best way to start your day.",
    "A smile can brighten the darkest day.",
    "Smile, it's free therapy.",
    "Your smile is a reflection of your soul.",
    "A smile is happiness you'll find right under your nose.",
    "Life is short. Smile while you still have teeth.",
    "A smile is a curve that sets everything straight.",
    "Smile! It increases your face value.",
    "Smile and be happy, because life is beautiful.",
    "A smile is a universal welcome.",
    "A smile is a light in the window of your face that tells people you're at home.",
    "When you smile, the world smiles with you.",
    "A smile is a powerful weapon; you can even break ice with it.",
    "If you have only one smile in you, give it to the people you love.",
    "A smile is a gift that can be shared with anyone.",
    "Smiles are free, but they are worth a lot.",
    "A smile is the easiest way to make yourself and others feel good.",
    "A smile is the key that fits the lock of everybody’s heart.",
    "You are never fully dressed without a smile.",
    "Smiling is contagious.",
    "A smile is a curve that can set things straight.",
    "Start every day with a smile and end it with one.",
    "A smile is the most inexpensive way to change your looks.",
    "Smile. It’s the second best thing you can do with your lips.",
    "A smile is an inexpensive way to change your looks.",
    "Smiling is a way of programming your brain to be happy.",
    "A smile can change the world, just make sure you smile to the right person.",
    "Sometimes your joy is the source of your smile, but sometimes your smile can be the source of your joy.",
    "Keep smiling, because life is a beautiful thing and there’s so much to smile about.",
    "There are hundreds of languages in the world, but a smile speaks them all.",
    "A smile is a window on your face to show your heart is at home.",
    "Your smile is a reflection of your love for life.",
    "Smiles are a way of sharing your happiness.",
    "A smile is a powerful thing. It can change everything.",
    "A smile is the best makeup any girl can wear.",
    "A smile is the best way to face every problem, to crush every fear, and to hide every pain.",
    "Every time you smile at someone, it is an action of love, a gift to that person, a beautiful thing.",
    "A smile can go a long way, especially if you are walking along.",
    "A smile is a symbol of friendship and happiness.",
    "A smile is the only curve that can set everything straight.",
    "A smile can light up the darkest of places.",
    "A smile can help you overcome your sadness.",
    "You never know how far a simple smile can go.",
    "A smile is the best thing to wear.",
    "When life gives you a hundred reasons to cry, show life that you have a thousand reasons to smile.",
    "A smile makes even the most boring days special.",
    "Your smile is the most important thing you wear every day.",
    "A smile is a choice, not a feeling.",
    "Don’t forget to smile today, no matter what.",
    "Smile, and the world will smile with you.",
    "A smile is an instant facelift.",
    "Smiling is the easiest way to be positive.",
    "A smile can open doors to infinite possibilities.",
    "A smile is a sign of a happy soul.",
    "The world always looks brighter from behind a smile.",
    "Smiling is a sign of confidence and success.",
    "A smile can be the beginning of a beautiful day.",
    "A smile is a silent message of happiness.",
    "Keep smiling, it will make your enemies wonder what you’re up to.",
    "Smile and let the world wonder why.",
    "A smile is a simple act that makes a big difference.",
    "Smiling can turn a bad day into a good one.",
    "A smile can create miracles in life.",
    "A smile is the ultimate form of self-expression.",
    "A smile can melt away all negativity.",
    "A smile is an invisible ray of sunshine.",
    "Smiling is like taking a shot of happiness.",
    "A smile is your logo, happiness is your trademark.",
    "A smile says everything without saying a word.",
    "The most beautiful curve on a woman's body is her smile.",
    "Smile at life, and life will smile at you.",
    "Your smile is a reflection of your heart.",
    "Smiles are the language of kindness.",
    "When life gives you lemons, make lemonade and smile.",
    "A smile is the best remedy for a bad day.",
    "Smile like you mean it!",
    "Every time you smile at someone, it’s an action of love, a gift to that person, a beautiful thing.",
    "A smile is a good way to start a conversation.",
    "The most attractive thing you can wear is your smile.",
    "A smile is the easiest way to show your happiness.",
    "There’s always a reason to smile, just find it.",
    "A smile can light up the darkest of days.",
    "Smiles are the best way to deal with problems.",
    "A smile can make all the difference in someone’s life.",
    "A smile is an affordable way to make someone’s day.",
    "Every smile makes you a little bit younger.",
    "A smile can make you feel like everything will be okay.",
    "A smile is the first step towards making someone's day better.",
    "A smile costs nothing but means everything.",
    "A smile can help brighten someone's world.",
    "A smile is a weapon to bring peace and joy.",
    "Smile today, and the world will smile with you.",
    "Smile and let everyone know you are happy.",
    "Your smile is your best accessory.",
    "A smile is a happiness generator.",
    "Smiling is the easiest way to make a good impression.",
    "A smile can change your mood instantly.",
    "Smile, it will make life easier.",
    "Smiling is a sign of strength, resilience, and positivity.",
    "Smiling can heal your soul.",
    "Keep smiling; it makes people wonder what you’re up to.",
    "A smile is the quickest way to make a positive impression.",
    "A smile is a way to make life a little bit better for everyone.",
    "Smiling is a way of sharing joy.",
    "A smile speaks a thousand words.",
    "A smile can say more than words ever could.",
    "A smile is a powerful tool to spread joy.",
    "A smile is a simple gift, but it can change someone's day.",
    "A smile is the best way to improve your day.",
    "A smile can open up new possibilities.",
    "A smile will never go out of style.",
    "Your smile is your superpower.",
    "A smile is a simple gesture that can brighten someone's day.",
    "A smile is a sign of a generous heart.",
    "Keep smiling, it looks good on you.",
    "A smile is contagious. Spread it around!",
    "Smiling is the best exercise for your face.",
    "Smiling is the easiest way to feel good inside.",
    "A smile shows your happiness to the world.",
    "Smiles can solve a lot of problems.",
    "A smile is a way of telling the world you’re happy to be alive.",
    "A smile can speak louder than words.",
    "A smile will make everything feel right again.",
    "Your smile is your way of saying, 'I’m happy.'",
    "Smiling is the best way to release your stress.",
    "A smile is an invitation to happiness.",
    "A smile is a good way to show you care.",
    "Smile! It’s free therapy."
]

