[
    "Why don't skeletons fight each other? They don't have the guts!",
    "I told my wife she was drawing her eyebrows too high. She looked surprised.",
    "I used to play piano by ear, but now I use my hands.",
    "The early bird might get the worm, but the second mouse gets the cheese.",
    "I broke my finger last week. On the other hand, I'm okay.",
    "Why don't eggs tell jokes? Because they might crack up!",
    "I don't trust stairs. They're always up to something.",
    "I accidentally swallowed some food coloring. The doctor says I'm OK but I feel like I've dyed a little inside.",
    "Parallel lines have so much in common. It’s a shame they’ll never meet.",
    "Why don’t oysters share their pearls? Because they’re shellfish!",
    "I told my computer I needed a break, and it froze.",
    "I used to be a baker, but I couldn’t make enough dough.",
    "I started a band called 1023MB. We haven’t got a gig yet.",
    "I’m reading a book on anti-gravity. It’s impossible to put down!",
    "What’s orange and sounds like a parrot? A carrot!",
    "I couldn’t figure out why I’m not friends with my kitchen sink. But then it dawned on me.",
    "Why was the math book sad? Because it had too many problems.",
    "I got a job as a professional cricket player. But they didn’t think I was a good catch.",
    "I used to be indecisive, but now I'm not so sure.",
    "Why do cows have hooves instead of feet? Because they lactose!",
    "I tried to catch some fog earlier. I mist.",
    "I used to be a baker, but I couldn’t make enough dough.",
    "I went to a seafood disco last week... and pulled a mussel.",
    "How do you organize a space party? You planet.",
    "What did one hat say to the other? Stay here, I'm going on ahead!",
    "I’m trying to lose weight, but it’s not working. I’m just getting ‘beefier’.",
    "I’m no good at math, but I can count on you.",
    "I don’t know what’s more annoying, that I can’t stop singing this song, or that I’m singing the song in a public place.",
    "Why can’t your nose be 12 inches long? Because then it would be a foot!",
    "I put my phone on airplane mode, but it’s not flying.",
    "I once got into an argument with a broken pencil. It was pointless.",
    "I don’t trust people who do acupuncture. They’re back stabbers.",
    "Why don’t seagulls fly over the bay? Because then they’d be bagels.",
    "I got a light bulb for Christmas. Now I’m thinking of switching it on.",
    "I’m not arguing, I’m just explaining why I’m right.",
    "Did you hear about the restaurant on the moon? Great food, no atmosphere.",
    "Why did the coffee file a police report? It got mugged!",
    "What’s a skeleton’s least favorite room in the house? The living room.",
    "What do you call fake spaghetti? An impasta!",
    "I couldn’t figure out how to put my seatbelt on. But then it clicked.",
    "I don’t want to brag, but I’m really good at my job as a mirror maker. I reflect well on my work.",
    "I saw a sign that said ‘watch for children,’ and I thought, ‘That sounds like a fair trade.’",
    "I like to play chess with old people. It’s like playing against a ‘knight’ in shining armor.",
    "Why was the broom late? It swept in.",
    "I don't know why I’m always so hungry when I get home, but I’m always eating leftovers. I guess that’s just how I ‘reheat’ my day.",
    "I told my wife she was drawing her eyebrows too high. She looked surprised.",
    "Why did the scarecrow win an award? Because he was outstanding in his field!",
    "I don’t trust trees. They’re shady.",
    "I’m reading a book on reverse psychology. Don’t bother trying to stop me.",
    "I don’t have a dad bod. I have a father figure.",
    "Did you hear about the guy who invented the knock-knock joke? He won the ‘no-bell’ prize.",
    "I ran into my ex at the grocery store. I’ll never buy vegetables from that store again.",
    "I asked the librarian if the library had books on paranoia. She whispered, ‘They’re right behind you.’",
    "Why do bicycles fall over? Because they’re two-tired!",
    "I told my wife she was drawing her eyebrows too high. She looked surprised.",
    "How does a penguin build its house? Igloos it together!",
    "I don’t trust people who do acupuncture. They’re back stabbers.",
    "Why was the broom late? It swept in.",
    "I don’t have a dad bod. I have a father figure.",
    "What’s a skeleton’s least favorite room in the house? The living room.",
    "I’m reading a book on anti-gravity. It’s impossible to put down!",
    "Why don’t skeletons fight each other? They don’t have the guts!",
    "Why did the coffee file a police report? It got mugged!",
    "I had a dream that I was a muffler last night. I woke up exhausted.",
    "I told my computer I needed a break, and it froze.",
    "Why did the banana go to the doctor? Because it wasn’t peeling well!",
    "I can't believe I got fired from the calendar factory. All I did was take a day off.",
    "I used to be a baker, but I couldn’t make enough dough.",
    "Why did the computer go to the doctor? Because it had a virus!",
    "Why was the math book sad? Because it had too many problems.",
    "I didn’t want to believe that my dad was stealing from his job as a traffic cop, but when I got home all the signs were there.",
    "I once tried to catch some fog. I mist.",
    "I couldn’t figure out how to put my seatbelt on. But then it clicked.",
    "I once got into an argument with a broken pencil. It was pointless.",
    "I’m not arguing, I’m just explaining why I’m right.",
    "Why did the tomato turn red? Because it saw the salad dressing!",
    "What do you call cheese that isn’t yours? Nacho cheese!",
    "I just wrote a book on reverse psychology. Don’t buy it.",
    "I told my wife she was drawing her eyebrows too high. She looked surprised.",
    "I asked the librarian if the library had books on paranoia. She whispered, ‘They’re right behind you.’",
    "I was going to tell you a joke about an elevator, but it’s an uplifting experience.",
    "I ran into my ex at the grocery store. I’ll never buy vegetables from that store again.",
    "Why did the bicycle fall over? Because it was two-tired!",
    "Why don't skeletons fight each other? They don't have the guts!",
    "I wanted to become a professional cricket player, but they told me I wasn’t a good catch.",
    "I’m really good at my job as a mirror maker. I reflect well on my work.",
    "Why don’t cows use computers? They’re afraid of the moo-se.",
    "I wanted to become a professional tennis player, but I could never serve.",
    "I made a pun about the wind, but it blew.",
    "I used to be a baker, but I couldn't make enough dough.",
    "I ran into a wall, but luckily it wasn’t a brick wall.",
    "I’m trying to lose weight, but it’s not working. I’m just getting beefier.",
    "Did you hear about the restaurant on the moon? Great food, no atmosphere.",
    "Why do cows wear bells? Because their horns don't work!"
]
