[
    "Why did the bicycle fall over? It was two-tired!",
    "How does a penguin build its house? Igloos it together!",
    "Why did the scarecrow win an award? Because he was outstanding in his field!",
    "What do you call fake spaghetti? An impasta!",
    "Why don't skeletons fight each other? They don’t have the guts.",
    "How do you catch a squirrel? Climb a tree and act like a nut!",
    "Why was the math book sad? It had too many problems.",
    "What did one wall say to the other? 'I’ll meet you at the corner!'",
    "Why can’t you give Elsa a balloon? Because she’ll let it go!",
    "Why did the golfer bring an extra pair of pants? In case he got a hole-in-one.",
    "What did the ocean say to the shore? Nothing, it just waved.",
    "How does a snowman get around? By riding an 'icicle'!",
    "Why did the tomato turn red? Because it saw the salad dressing!",
    "What do you call an alligator in a vest? An investigator!",
    "How do cows stay up to date? They read the moooos-paper.",
    "Why are ghosts bad at lying? Because they’re too transparent.",
    "Why couldn’t the pony sing? Because it was a little hoarse.",
    "How do you organize a space party? You planet.",
    "What kind of tree fits in your hand? A palm tree!",
    "What did one hat say to the other? 'You stay here, I'll go on ahead.'",
    "Why did the cookie go to the doctor? Because it felt crumby.",
    "What do you get when you cross a vampire with a snowman? Frostbite!",
    "Why was the math teacher suspicious? She counted on her students.",
    "How does a dog stop a movie? It presses the 'paws' button!",
    "Why did the picture go to jail? It was framed!",
    "Why did the chicken join the band? Because it had drumsticks!",
    "What did the left eye say to the right eye? 'Between you and me, something smells.'",
    "How do bees brush their hair? With honeycombs!",
    "Why couldn’t the leopard play hide and seek? Because he was always spotted.",
    "What’s orange and sounds like a parrot? A carrot.",
    "What’s a computer’s favorite snack? Microchips.",
    "What kind of shoes do ninjas wear? Sneakers.",
    "Why don’t scientists trust atoms? Because they make up everything!",
    "Why are frogs so happy? They eat whatever bugs them.",
    "What do you call a pig that knows karate? A pork chop.",
    "How do pickles enjoy a day out? They relish it.",
    "Why did the banana go to the doctor? It wasn’t peeling well.",
    "What do you get if you cross an angry sheep with a moody cow? An animal in a baaaad moooood.",
    "Why was the broom late? It swept in!",
    "What does a nosy pepper do? It gets jalapeño business.",
    "Why are teddy bears never hungry? They’re always stuffed.",
    "How does the moon cut his hair? Eclipse it.",
    "What did the fisherman say to the magician? 'Pick a cod, any cod.'",
    "Why did the gym close down? It just didn’t work out.",
    "What’s brown and sticky? A stick.",
    "How does a cucumber become a pickle? It goes through a jarring experience.",
    "What did one plate say to another? 'Lunch is on me.'",
    "Why did the man run around his bed? To catch up on his sleep!",
    "What’s a skeleton’s least favorite room? The living room.",
    "Why are pirates such good singers? Because they can hit the high C’s!",
    "What’s a cat’s favorite color? Purr-ple.",
    "Why did the mushroom go to the party? Because he was a fungi.",
    "Why can’t your nose be 12 inches long? Because then it would be a foot.",
    "How does a scientist freshen her breath? With experi-mints.",
    "Why did the coffee file a police report? It got mugged.",
    "How do rabbits travel? By hare-plane.",
    "Why did the melon jump into the lake? It wanted to be a watermelon.",
    "What did the big flower say to the little flower? 'Hey, bud.'",
    "How do you make a tissue dance? Put a little boogie in it.",
    "What did one volcano say to the other? 'I lava you.'",
    "Why did the math teacher love nature? Because of its natural logs.",
    "How do you talk to a giant? Use big words!",
    "Why did the belt go to jail? Because it held up a pair of pants.",
    "What does a storm cloud wear under his raincoat? Thunderwear.",
    "How does a tree access the internet? It logs in.",
    "What did the pencil say to the eraser? 'You make my mistakes disappear.'",
    "What do you call a cow with no legs? Ground beef.",
    "Why did the girl bring a ladder to school? She wanted to go to high school.",
    "What do you call a dinosaur that never gives up? A try-ceratops.",
    "What’s a snake’s favorite subject? Hiss-tory.",
    "Why did the golfer bring an umbrella? Because there was a fair-way of rain.",
    "How do fish listen to music? On their bass drums.",
    "What do you call a bear with no teeth? A gummy bear.",
    "Why are ghosts so bad at lying? Because you can see right through them!",
    "What do you get when you cross a duck with a firework? A fire-quacker!",
    "Why do chickens sit on eggs? Because they don’t have chairs.",
    "How do mountains stay warm? They put on snow caps.",
    "What do you call cheese that isn’t yours? Nacho cheese.",
    "What did the grape do when it got stepped on? It let out a little wine.",
    "What did the frog order at McDonald's? French flies and a diet croak.",
    "Why did the bike stop? It was too tired!",
    "What’s a baby snake’s favorite game? Hide and sssss-eek.",
    "Why did the tomato blush? Because it saw the salad dressing!",
    "What does a cloud wear under his raincoat? Thunderwear.",
    "Why can’t Elsa have a balloon? She’ll let it go!",
    "Why don’t eggs tell each other secrets? They might crack up.",
    "How does a scientist freshen her breath? With experi-mints.",
    "What did one firefly say to the other? 'You glow, girl!'",
    "Why don’t some fish play piano? Because they can’t tuna fish.",
    "Why was the sand wet? Because the sea weed!",
    "How do bees get to school? They take the buzz.",
    "Why do seagulls fly over the sea? If they flew over the bay, they’d be bagels.",
    "Why did the belt go to jail? It held up a pair of pants!",
    "What do ghosts wear when it rains? Boo-ts.",
    "Why are ghosts so bad at telling lies? Because you can see right through them!",
    "Why did the duck get a gold medal? For his outstanding quack.",
    "What did the bee say to the flower? 'Hello, honey.'",
    "Why was the tree happy? It was branching out.",
    "Why was the skeleton afraid of the storm? He didn’t have the guts.",
    "What kind of music do mummies like? Wrap music."
]
